app/views/admin/items/edit.html.erb

            <tr><th>商品説明</th><td><%= item.text_area :explanation %></td></tr>
            <tr><th>ジャンル</th><td><%= item.collection_select :genre_id, Genre.all, :id, :name %></td></tr>
---
SELECT "genres".* FROM "genres"