app/views/admin/items/edit.html.erb

      <%= item.text_area :explanation %><br>
      <%= item.collection_select :genre_id, Genre.where(is_active: "true"), :id, :name %>
---
SELECT "genres".* FROM "genres" WHERE "genres"."is_active" = ?  [["is_active", 1]]