app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres" WHERE "genres"."is_active" = ?  [["is_active", 1]]
---
      <%= item.text_area :explanation %><br>
      <%= item.collection_select :genre_id, Genre.where(is_active: "true"), :id, :name %>