app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aaa"], ["is_active", 0], ["created_at", "2020-08-18 04:16:13.881775"], ["updated_at", "2020-08-18 04:16:13.881775"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "is_active" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["is_active", 0], ["updated_at", "2020-08-18 04:30:23.177570"], ["id", 2]]
---
  def update
    genre = Genre.find(params[:id])
    genre.update(genre_params)