app/controllers/admin/items_controller.rb

  def create
    item = Item.new(item_params)
    item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "price", "explanation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["genre_id", 2], ["name", "もん"], ["image_id", nil], ["price", 124], ["explanation", "dsa"], ["created_at", "2020-08-19 00:43:33.499386"], ["updated_at", "2020-08-19 00:43:33.499386"]]

  def show
    @item = Item.find(params[:id])
    @price = Item.all.sum(:price)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items"
SELECT SUM("items"."price") FROM "items"

  def update
    item = Item.find(params[:id])
    item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "189601ed5fb9be23a46a594f840e23da4111074b573c41da7f4ebd8255e4"], ["is_active", nil], ["updated_at", "2020-08-19 00:48:48.197816"], ["id", 1]]