app/controllers/admin/members_controller.rb

  def update
    member = Member.find(params[:id])
    member.update(member_params)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "first_name" = ?, "last_name" = ?, "kana_first_name" = ?, "kana_last_name" = ?, "postcode" = ?, "address" = ?, "phone_number" = ?, "updated_at" = ? WHERE "members"."id" = ?