app/controllers/member/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" IS NULL AND "cart_items"."member_id" = ? LIMIT ?  [["member_id", 4], ["LIMIT", 1]]
---
  def index
    @member = current_member
    @cart_items = @member.cart_items.all

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" IS NULL AND "cart_items"."member_id" = ? LIMIT ?  [["member_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("item_id", "member_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["member_id", 1], ["quantity", 2], ["created_at", "2020-08-19 06:17:36.032357"], ["updated_at", "2020-08-19 06:17:36.032357"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."member_id" = ?  [["member_id", 1]]
---
  def create
    # ログイン会員の空のカート作成
    @cart_item = current_member.cart_items.build(cart_item_params)
    # 現在カートに入っている商品
    @current_item = CartItem.find_by(item_id: @cart_item.item_id)
    # カートに同じ商品がなければ新規追加、あれば既存のデータと合算
    if @current_item.nil?
      if @cart_item.save
        flash[:success] = 'カートに商品が追加されました！'
        redirect_to members_cart_items_path
      else
        # ログイン会員のカート内の全商品
        @cart_items = @member.cart_items.all

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_cart_item
    @cart_item = CartItem.find(params[:id])