app/controllers/member/delivery_addresses_controller.rb

INSERT INTO "delivery_addresses" ("member_id", "address", "postcode", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["member_id", 3], ["address", "aaaa"], ["postcode", "0000000"], ["name", "aaa"], ["created_at", "2020-08-21 04:45:56.057925"], ["updated_at", "2020-08-21 04:45:56.057925"]]
---
  def create
    @delivery_address = DeliveryAddress.new(delivery_address_params)
    @delivery_address.member_id = current_member.id
    if @delivery_address.save

SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @delivery_address = DeliveryAddress.find(params[:id])

SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "delivery_addresses" SET "postcode" = ?, "address" = ?, "name" = ?, "updated_at" = ? WHERE "delivery_addresses"."id" = ?  [["postcode", "sss"], ["address", "sss"], ["name", "sss"], ["updated_at", "2020-08-21 08:02:42.341024"], ["id", 6]]
---
  def update
    @delivery_address = DeliveryAddress.find(params[:id])
    if @delivery_address.update(delivery_address_params)

SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @delivery_address = DeliveryAddress.find(params[:id])
    @delivery_address.destroy