app/controllers/member/items_controller.rb

SELECT "genres".* FROM "genres"
SELECT "items".* FROM "items"
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @genres = Genre.all
    @items = Item.all
    @items = Item.page(params[:page]).per(8)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @genres = Genre.all
    @item = Item.find(params[:id])