app/controllers/member/members_controller.rb

  def show
    @member = Member.find(current_member.id)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @member = Member.find(current_member.id)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @member = Member.find(current_member.id)
    if @member.update(member_params)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "members" SET "last_name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["last_name", "三郎"], ["updated_at", "2020-08-21 07:17:53.910073"], ["id", 3]]

  def resignation
    @member = Member.find(current_member.id)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def quit
    @member = Member.find(current_member.id)
    #is_deletedカラムにフラグを立てる(defaultはfalse)
    @member.update(is_delete: true)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "members" SET "is_delete" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["is_delete", 1], ["updated_at", "2020-08-22 04:47:46.528011"], ["id", 4]]